import { addMovieProperties } from "src/api/conf/movieProperties";

export const animations = [
  {
    name: {
      englishname: "Black Clover",
      name: "شبدر سیاه ",
    },
    desc: " پسری جوان به نام آستا که پدر و مادرش از نوزادی او را در یک کلیسا رها کرده اند، اکنون به همراه دوستش یونو، عهد می بندند تا برای رسیدن به مقام امپراطوری با یکدیگر رقابت کنند و...",
  },
  {
    name: {
      englishname: "Alice's Wonderland Bakery",
      name: " شیرینی پزی سرزمین عجایب آلیس ",
    },
    desc: "آلیس نوه نبیره (فرزند نوه) آلیس در سرزمین عجاب است. او قناد جوان و مشتاق در نانوایی سرزمین عجایب است و با خوراکی های جدید نسل تازه ای از شخصیتها را گرد هم می آورد.",
  },
  {
    name: {
      englishname: " Angry Birds: Summer Madness",
      name: "پرندگان خشمگین جنون تابستانی ",
    },
    desc: " وقتی رد، چاک، بمب و استلا تابستان پرهیجانی را با پرندگان خشمگین دیگر در اردوگاه اسپلینتروود می گذرانند، گرد و خاکی به پا می شود و جرقه و پر است که به آسمان می رود!",
  },
  {
    name: {
      englishname: " Angry Birds: Summer Madness",
      name: "پرندگان خشمگین جنون تابستانی ",
    },
    desc: " وقتی رد، چاک، بمب و استلا تابستان پرهیجانی را با پرندگان خشمگین دیگر در اردوگاه اسپلینتروود می گذرانند، گرد و خاکی به پا می شود و جرقه و پر است که به آسمان می رود!",
  },
  {
    name: { englishname: "pil", name: " ماجراهای پیل " },
    desc: "کودک یتیمی به اسم پیل همراه با سه راسوی خود در خیابان های شهر رک آن بروم زندگی می کند، او تنها با دزدین غذا از قلعه تریستین، حاکم شروری که تخت پادشاهی را غصب کرده، می تواند زنده بماند، یک روز پیل برای مخفی شدن از دست محافظین پادشاه که تعقیبش می کنند، لباس یک شاهزاده را بر تن می کند و....",
  },
  {
    name: { englishname: "Big Nate ", name: " نیت بزرگ " },
    desc: " دانش آموز بازیگوش کلاس ششمی و دو دوست صمیمی‌اش را روایت می کند. این سه نفر هر از گاهی با هم به مشکل برمی‌خورند، چه در خانه و چه در مدرسه با چالش‌های فراوانی روبرو می شوند و دردسرهای بسیاری ایجاد می‌کنند.",
  },
  {
    name: { englishname: "We Baby Bears ", name: "ما خرس های کوچولو " },
    desc: "سه خرس کوچک به نام های گریزلی، پاندا و آیس به دنبال یافتن خانه ای مناسب برای خود هستند، آنها در این مسیر با ماجراهایی زیادی مواجه می شوند و...",
  },
  {
    name: { englishname: "Big Nate ", name: " نیت بزرگ " },
    desc: " دانش آموز بازیگوش کلاس ششمی و دو دوست صمیمی‌اش را روایت می کند. این سه نفر هر از گاهی با هم به مشکل برمی‌خورند، چه در خانه و چه در مدرسه با چالش‌های فراوانی روبرو می شوند و دردسرهای بسیاری ایجاد می‌کنند.",
  },
  {
    name: { englishname: "Big Nate", name: "دنیای موازی" },
    desc: " دانش آموز بازیگوش کلاس ششمی و دو دوست صمیمی‌اش را روایت می کند. این سه نفر هر از گاهی با هم به مشکل برمی‌خورند، چه در خانه و چه در مدرسه با چالش‌های فراوانی روبرو می شوند و دردسرهای بسیاری ایجاد می‌کنند.",
  },
  {
    name: { englishname: "Big sky", name: "فراتر از اسمان" },
    desc: " دانش آموز بازیگوش کلاس ششمی و دو دوست صمیمی‌اش را روایت می کند. این سه نفر هر از گاهی با هم به مشکل برمی‌خورند، چه در خانه و چه در مدرسه با چالش‌های فراوانی روبرو می شوند و دردسرهای بسیاری ایجاد می‌کنند.",
  },
  {
    name: {
      englishname: "Angry Birds: Summer Madness",
      name: "پرندگان خشمگین جنون تابستانی",
    },
    desc: "وقتی رد، چاک، بمب و استلا تابستان پرهیجانی را با پرندگان خشمگین دیگر در اردوگاه اسپلینتروود می گذرانند، گرد و خاکی به پا می شود و جرقه و پر است که به آسمان می رود!",
  },
  {
    name: {
      englishname: "Angry Birds: Summer Madness",
      name: "پرندگان خشمگین جنون تابستانی",
    },
    desc: "وقتی رد، چاک، بمب و استلا تابستان پرهیجانی را با پرندگان خشمگین دیگر در اردوگاه اسپلینتروود می گذرانند، گرد و خاکی به پا می شود و جرقه و پر است که به آسمان می رود!",
  },
];

addMovieProperties(
  {
    englishname: "animations",
    name: "انیمیشن",
  },
  { name: "آمریکا", englishname: "America" },
  animations
);
