import { addMovieProperties } from "src/api/conf/movieProperties";

export const koreans = [
  {
    name: { englishname: "", name: "کره‌ای سر آستین قرمز " },
    desc: " در قرن هجدهم میلادی روایت شده و داستان عشق میان پادشاه جونگ جو و بانوی دربار سونگ دئوک ایم را به تصویر کشیده است. سونگ دئوک ایم یک بانوی دربار است که عاشق ولیعهد جونگ جو می‌شود. ولیعهد در نهایت پادشاه شده و حال می‌خواهد سونگ دئوک ایم صیغه وی شود. اما سونگ دئوک ایم این موضوع را قبول نمی‌کند زیرا وی قصد دارد آزادانه زندگی کند، چیزی که به عنوان یک صیغه امکان‌پذیر نخواهد بود و…",
  },
  {
    name: { englishname: "", name: "کیمیای روح" },
    desc: "(Alchemy of Souls) با عنوان اصلی (Hwanhon) یک مجموعه کمدی، درام، عاشقانه، تاریخی و فانتزی محصول کشور کره جنوبی به کارگردانی پارک جون-هوا (Park Joon-hwa) است که فصل اول آن در قالب 20 قسمت در سال 2022 میلادی توسط دو کمپانی Studio Dragon و High Quality تولید و منتشر شد؛ فیلمنامه این را نیز جونگ یون هونگ، می-ران هونگ و پارک جون هوا به صورت مشترک به رشته تحریر درآورده و هنرمندانی چون لی جه-ووک، جونگ سو-مین، هوانگ مین-هیون، نارا اوه، این سو یو، سونگ هو شین، یو جون سانگ و غیره در آن به ایفای نقش پرداخته‌اند؛",
  },
  {
    name: { englishname: " Dear. M", name: "ام عزیزم " },
    desc: "در مورد فردی ناشناس ملقب به اِم “M” است که در وب سایت انجمن دانشجویی دانشگاه سئویون، اعترافی را منتشر می‌کند. حال این متن منتشر شده دانشگاه سئویون را به کلی زیر و رو کرده و به هم می‌ریزد. در این میان چهار دانشجو که از بخش‌های مختلف دانشگاه آمده‌اند، ما جوآه (پارک هی سو)، چا مین هو (جئونگ جائه هیون)، سئو جی مین (نو جونگ اوی) و پارک هانول (بائه هیون-سونگ) در جستجوی “M” هستند. آن‌ها در طول جستجوی خود زندگی دانشگاهی، تغییر دوستی‌ها و عاشقانه‌های نوپا را تجربه کرده و…",
  },
  {
    name: { englishname: "", name: "انیمه ژاپنی 86" },
    desc: " در مورد جمهوری سن ماگنولیا است که در حال جنگ با کشور همسایه خود، امپراتوری گیاد می‌باشد؛ هر دو طرف از پهپادهای بدون سرنشین برای انجام جنگی بدون تلفات استفاده می‌کنند. در این میان یک نیروی نظامی به نام لنا گروهی از هواپیماهای بدون سرنشین به نام 86 را فرماندهی می‌کند و…",
  },

  {
    name: { englishname: "Rose Mansion", name: "عمارت رز" },
    desc: " در مورد زنی به نام جی نا (با بازی لیم جی-یئون) است که به عنوان یک کارمند قراردادی در یک هتل کار می‌کند. به نظر می‌رسد که او یک زندگی عادی دارد، اما از نظر درونی، جی نا پر از عقده حقارت است. یک روز او متوجه می‌شود که خواهر بزرگترش جی هیون، ناپدید شده است. حال جی نا به عمارت رز، جایی که پدر و مادرش زندگی می‌کنند، رفته و در آنجا با شرایط غیر منتظره‌ای روبرو می شود که…",
  },
  {
    name: {
      englishname: "Extraordinary Attorney Woo",
      name: " وکیل ووی عجیب غریب",
    },
    desc: " ابیگل که به تازگی طلاق گرفته و صاحب دو فرزند است، تلاش دارد تا اوضاع زندگی‌اش را درست کند. همچنین خانواده‌اش دچار مشکلات و مسائلی هستند که ابیگل در چالش با آن‌ها است.",
  },
  {
    name: { englishname: "?Why Her", name: "چرا او؟" },
    desc: " در مورد زنی جوان به نام اوه سوجه (با بازی سئو هیون جین) است که به عنوان یک وکیل با استعداد، جوانترین عضو یک موسسه حقوقی معتبر به نام TK می‌باشد. اوه سوجه به دلیل تمایلش برای برنده شدن در تمامی پرونده‌ها و همچنین اصول خودپسندانه‌اش شناخته شده می‌باشد. اما زمانی که او درگیر یک اتفاق غیرمنتظره می‌شود، به عنوان یک استاد کمکی به دانشکده حقوق فرستاده شده و تنزل رتبه می‌یابد. در دانشکده حقوق، او با دانشجویی به نام گونگ چان (با بازی هوانگ این یوپ) آشنا می‌شود. گونگ چان با وجود گذشته دردناکش هنوز هم قلب مهربانی دارد. در این میان او عاشق اوه سوجه شده و هر کاری برای محافظت از او انجام می‌دهد اما…",
  },
  {
    name: { englishname: "Parallels", name: "موازی ها" },
    desc: " در مورد چهار دوست است که پس از وقوع یک حادثه اسرارآمیز از دنیای خود جدا شده و هر کدام در دنیاهای موازی پراکنده می‌شوند. حال هر یک از این چهار نفر تمام تلاش خود را می‌کنند تا بفهمند دقیقا چه اتفاقی افتاده و در عین حال راهی برای بازگشت به دنیای اصلی خود نیز پیدا کنند اما…",
  },
  {
    name: { englishname: "Once Again", name: "یک بار دیگر" },
    desc: "در مورد زوج سالخورده‌ای است که با وجود داشتن 4 فرزند با یکدیگر ازدواج کرده‌اند. در این میان فرزندان آن‌ها در زندگی با مشکلات مختلفی دست و پنجه نرم می‌کنند که این موضوع بر روی زندگی والدینشان نیز تاثیر گذاشته و… ",
  },
  {
    name: { englishname: "", name: " به عروسی جهنمی خوش آمدید" },
    desc: "در مورد زن و مردی است که خود را برای یک مراسم عروسی رویایی آماده می‌کنند. اما واقعیت با آنچه در رویاهایشان تصور می‌کردند کاملا متفاوت است و همه چیز از ملاقات خانواده‌هایشان گرفته تا پیدا کردن خانه، با چالش‌های فراوانی روبرو شده و…",
  },
  {
    name: { englishname: "The King’s Avatar", name: "آواتار پادشاه" },
    desc: "در مورد “یه شیو” (با بازی یانگ یانگ)، یک بازیکن شناخته شده و درجه یک در بازی آنلاین گلوری است. اما زمانی که او به اجبار از تیم حرفه‌ای خود اخراج می‌شود، در یک کافی نت به عنوان یک کارگر استخدام می‌شود. حال یه شیو تصمیم می‌گیرد با خلق یک شخصیت جدید، بار دیگر وارد بازی آنلاین گلوری شده تا شکوه خود را دوباره به دست آورد اما…",
  },
  {
    name: { englishname: "Eve", name: "حوا" },
    desc: "در مورد دختری جوان به نام لی را-ال (با بازی سئو یه-جی) است که همراه با پدر و مادرش زندگی بسیار خوبی را سپری می‌کند. اما زمانی که پدر لی را-ال توسط افرادی ناشناس کشته می‌شود، خانواده او از هم می‌پاشد. حال لی را-ال که پس از این حادثه وحشتناک، به فردی تلخ و سرسخت تبدیل شده، تصمیم می‌گیرد تا انتقام مرگ پدرش را از افراد ثروتمندی که این تراژدی وحشتناک را به راه انداختند، گرفته و…",
  },
];

addMovieProperties(
  {
    englishname: "koreans",
    name: "کره ای",
  },
  { name: "کره جنوبی", englishname: "korea" },
  koreans,
);
