import { generateID, random } from "src/api/conf/movieProperties";
export const comments = [
  {
    name: "علی",
    message: "فیلم عالییییییی بود حرف نداشت به جرعت میشه گفت بهترین سری ها",
  },
  {
    name: "alireza",
    message: "روز اول انتشار دیدم",
  },
  {
    name: "فاطیما",
    message:
      "این سری بد تو کارش نیست عالی تر از همیشه، قسمت جدید کی میاداین سری بد تو کارش نیست عالی تر از همیشه، قسمت جدید کی میاد",
  },
  {
    name: "کاربر",
    message: "همه قسمتاش و صحنه هاش جذابن",
  },
  {
    name: "کاربر",
    message: "ببین سریالش خیلی خوب بود ولی آخرش رو خیییلی چرت تموم کردن",
  },
  {
    name: "محسن",
    message: "کارتون عالیه و ممنون از دوبله سریعتون ♥️♥️",
  },
  {
    name: "زهرا",
    message: "بنازممم عالی مخصوصا خدای ماه خونس عالیه جذاب و قدرتی",
  },
  {
    name: "کوثر",
    message:
      "اصلا خیلی عالی بود اول سریال همه چی خیلی مبهم بود ولی الان سریال به شفکر کنم یکی از بهترین سریال های این سری باشه",
  },
  {
    name: "کاربر",
    message: "توی فیلم از بس ابعاد قاطی شده جای دکتر استرنج خالیه :))",
  },
  {
    name: "دریا",
    message: "عالییییییییییییییییییییییییی",
  },
  {
    name: "طاها",
    message: "وای عاشقش شدم لطفا سریع دوبله کنید",
  },
  {
    name: "Reza",
    message: "قسمت ۵ ش از ۴ ش گنگ تر بود",
  },
  {
    name: "علی",
    message: "عاللللیه ممنون از ام تیوی که انقدر سریع فیلمو با دوبله میزاره",
  },
  {
    name: "کاربر",
    message:
      "سلام سریال بشدت زیبایی و قسمت هاش هر پنجشنبه توی سایت آپ تی وی قرار میگیره",
  },
  {
    name: "نگین",
    message:
      "ینی خود جنسه همه سریال های این سری رو نگاه کردم این یکی خیلیییییی سرتره",
  },
  {
    name: "sakine",
    message: "اپ تی وی دانلود نیم بها داره همین باعث برتریشه",
  },
  {
    name: "یاسین",
    message: "اخرای قسمت چهارش خیلی عجیب شد ناموصا",
  },
  {
    name: "Negin",
    message: "فوق‌العاده زیبا و تاثیرگذار",
  },
];

const addCommentProperty = () => {
  for (let comment of comments) {
    comment.id = generateID(10);
    comment.like = random(0, 1000);
    comment.dislike = random(0, 1000);
    comment.date = `${random(0, 30) + 1350}/${random(1, 13)}/${random(1, 39)}`;
  }
};
addCommentProperty();
